class Questions:
    que =[
        
        
####################################################################
        {'ques':['아래와 같이 출력하세요',
                   'print를 사용하세요\n',
                   '----------------------\n',
                   'hello'],
           'answ':['hello'], 
           'must':['print']},
        
        {'ques':['아래와 같이 출력하세요',
                   'print를 사용하세요\n',
                   '----------------------\n',
                   'thanks'],
           'answ':['thanks'],
           'must':['print']},
        
####################################################################
        {'ques':['아래와 같이 출력하세요',
                   'print와 +를 사용하세요\n',
                   '변수 a b c를 모두 사용하세요\n',
                   '----------------------\n',
                   6],
           'answ':[6],
           'must':['print','+','a','b','c']},
        
        {'ques':['아래와 같이 출력하세요',
                   'print와 -를 사용하세요\n',
                   '변수 a b c를 모두 사용하세요\n',
                   '----------------------\n',
                   8],
           'answ':[8],
           'must':['print','-','a','b','c']},
        
        {'ques':['아래와 같이 출력하세요',
                   'print와 *를 사용하세요\n',
                   '변수 a b c를 모두 사용하세요\n',
                   '----------------------\n',
                   16],
           'answ':[16],
           'must':['print','*','a','b','c']},
                
        {'ques':['아래와 같이 출력하세요',
                   'print와 /를 사용하세요\n',
                   '변수 a b c를 모두 사용하세요\n',
                   '----------------------\n',
                   4.0],
           'answ':[4.0],
           'must':['print','/','a','b','c']},
####################################################################        
        {'ques':['아래와 같이 출력하세요',
                   'for를 사용하세요\n',
                   '----------------------\n',
                   '0\n1\n2\n3\n4\n'],
           'answ':[0,1,2,3,4],
           'must':['print','for']},
        
        {'ques':['아래와 같이 출력하세요',
                   'for를 사용하세요\n',
                   '----------------------\n',
                   '5\n4\n3\n2\n1\n'],
           'answ':[5,4,3,2,1],
           'must':['print','for']},
        
        {'ques':['아래와 같이 출력하세요',
                   'for를 사용하세요\n',
                   '----------------------\n',
                   '1x2=2\n2x2=4\n3x2=6\n4x2=8\n5x2=10\n6x2=12\n7x2=14\n8x2=16\n9x2=18\n'],
           'answ':['1x2=2','2x2=4','3x2=6','4x2=8','5x2=10','6x2=12','7x2=14','8x2=16','9x2=18'],
           'must':['print','for']},
####################################################################
    ]